2.WS-Standards/2.UserNameTokenAuthenticationImpl.md

#WS Security

##	Authentication

### User Name Token Profile

-	It's a ws standard used to implement security on the ws
-	User Name Token Profile involves adding headers to Soap Messages
-	Authentication details will be sent in soap header with user name and password field


##	Steps to implement Authentication Security Standard

-	Add Security Dependency
	
	<!-- https://mvnrepository.com/artifact/org.apache.cxf/cxf-rt-ws-security -->
		<dependency>
			<groupId>org.apache.cxf</groupId>
			<artifactId>cxf-rt-ws-security</artifactId>
			<version>2.4.1</version>
		</dependency>

	
-	Configure WSS4J INInterceptors
	-	WSS4J stands for WS Security for Java
	-	WSS4JInInterceptor will used to intercept the incoming soap messages
	-	Create the interceptor config so that incoming requests will go through interceptors
	-	Create a Map with WSS4J Properties
	-	Create a WSS4JInInterceptor instance with Map having the properties
	-	Add WSS4JInInterceptor instance to EndpointImpl instance
	
		
	Code Snippet:
	
		@Configuration
		public class PaymentProcessorConfig {

			@Autowired
			private Bus bus;
			@Bean
			public Endpoint publishPaymentProcessorEndpoint() {
				EndpointImpl endpoint = new EndpointImpl(bus, new PaymentProcessorImpl());
				endpoint.publish("/processPayment");
				
				Map<String, Object> map = new HashMap<>();
				map.put(ConfigurationConstants.ACTION,ConfigurationConstants.USERNAME_TOKEN);
				map.put(ConfigurationConstants.PASSWORD_TYPE,WSConstants.PASSWORD_TEXT);
				map.put(ConfigurationConstants.PW_CALLBACK_CLASS,UTPasswordCallback.class.getName());
				
				WSS4JInInterceptor wss4jInterceptor = new WSS4JInInterceptor(map);
				endpoint.getInInterceptors().add(wss4jInterceptor);
				
				
				return endpoint;
			}
		}
	
-	Create the password callback
	-	Provide a implementation class that implements CallBackHandler class
	-	Create a in-memory db or make a LDAP call or DB Call to get the user credential details
	-	Check if username is matching 
	-	Set the Username if matches
	
	
	Code Snippet:
	
		public class UTPasswordCallback implements CallbackHandler {

			private Map<String, String> imDB = new HashMap<>();
			
			public  UTPasswordCallback() {
				imDB.put("bharath", "bharath");
				imDB.put("xml", "xml");
			}
			
			
			
			@Override
			public void handle(Callback[] callbacks) throws IOException, UnsupportedCallbackException {
				for(Callback cb : callbacks) {
					WSPasswordCallback passwordCallback = (WSPasswordCallback)cb;
					String password = imDB.get(passwordCallback.getIdentifier());
					if(Optional.ofNullable(password).isPresent()) {
						passwordCallback.setPassword(password);
						return;
					}
				}
			}

		}
	

-	Add the Header to Soap Request Messages
		
	 <soapenv:Header>
  <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
  <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <wsse:Username xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">bharath</wsse:Username>
  <wsse:Password xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">bharath</wsse:Password>
  </wsse:UsernameToken>
  
	-	After adding header to the request
	
	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.ws.bharath.com/">
		<soapenv:Header>
			<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
			<wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:Username xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">bharath</wsse:Username>
			<wsse:Password xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">bharath</wsse:Password>
			</wsse:UsernameToken>
			</wsse:Security>
	   </soapenv:Header>
	   <soapenv:Body>
		  <soap:processPayment>
			 <!--Optional:-->
			 <paymentProcessorRequest>
				<!--Optional:-->
				<creditCardInfo>
				   <!--Optional:-->
				   <cardNumber>12344</cardNumber>
				   <!--Optional:-->
				  
				   <!--Optional:-->
				   <firstName>bharath</firstName>
				   <!--Optional:-->
				   <lastName>a</lastName>
				   <!--Optional:-->
				   <secCode>1</secCode>
				   <!--Optional:-->
				   <Address>aaa</Address>
				</creditCardInfo>
				<!--Optional:-->
				<amount>10</amount>
			 </paymentProcessorRequest>
		  </soap:processPayment>
	   </soapenv:Body>
	</soapenv:Envelope>

		
		
-	Run the test


## UserName Token Client


### Steps to create User Name Token Client

-	Create the soap project
-	Add the wsdl and generate the stubs
-	Add the maven code gen plugin to generate stubs from wsdl
-	Create a client with WS service and port 
-	Create client and get endpoint from client
-	Create WSS4JOutInterceptor with properties
-	Add the WSS4JOutInterceptor to endpoint 
-	Call the service


	Code Snippet:
	
		public class UTSoapClient {

			public static void main(String[] args) throws MalformedURLException {

				PaymentProcessorImplService paymentProcessorImplService = new PaymentProcessorImplService(
						new URL("http://localhost:8080/paymentProcessor/processPayment?wsdl"));
				
				PaymentProcessor paymentProcessorImplPort = paymentProcessorImplService.getPaymentProcessorImplPort();
				
				Client client = ClientProxy.getClient(paymentProcessorImplPort);
				Endpoint endpoint = client.getEndpoint();
				
				
				Map<String, Object> map = new HashMap<>();
				
				map.put(WSHandlerConstants.ACTION, WSConstants.USERNAME_TOKEN);
				map.put(WSHandlerConstants.USER, "bharath");
				map.put(WSHandlerConstants.PASSWORD_TYPE, WSConstants.PW_TEXT);
				map.put(WSHandlerConstants.PW_CALLBACK_CLASS, UTPasswordCallback.class.getName());
				
				
				WSS4JOutInterceptor wss4jout = new WSS4JOutInterceptor(map);
				
				endpoint.getOutInterceptors().add(wss4jout);
				
				PaymentProcessorResponse processPayment = paymentProcessorImplPort.processPayment(new PaymentProcessorRequest());
				System.out.println(processPayment.isResult());
			}
		}
		
		public class UTPasswordCallback implements CallbackHandler {

			@Override
			public void handle(Callback[] callbacks) throws IOException, UnsupportedCallbackException {
				for(Callback cb : callbacks) {
					WSPasswordCallback passwrdCallback = (WSPasswordCallback) cb;
					if(passwrdCallback.getIdentifier().equals("bharath")) {
						passwrdCallback.setPassword("bharath");
						return;
					}
				}
			}

		}



	


	
